package scraper_constant

type Region struct {
	Iso3166 string `json:"iso3166"`
	Name    string `json:"name"`
}

var Regions = []Region{
	{
		Iso3166: "RU-ALT",
		Name:    "Алтайский край",
	},
	{
		Iso3166: "RU-AMU",
		Name:    "Амурская область",
	},
	{
		Iso3166: "RU-ARK",
		Name:    "Архангельская область",
	},
	{
		Iso3166: "RU-AST",
		Name:    "Астраханская область",
	},
	{
		Iso3166: "RU-BEL",
		Name:    "Белгородская область",
	},
	{
		Iso3166: "RU-BRY",
		Name:    "Брянская область",
	},
	{
		Iso3166: "RU-VLA",
		Name:    "Владимирская область",
	},
	{
		Iso3166: "RU-VGG",
		Name:    "Волгоградская область",
	},
	{
		Iso3166: "RU-VLG",
		Name:    "Вологодская область",
	},
	{
		Iso3166: "RU-VOR",
		Name:    "Воронежская область",
	},
	{
		Iso3166: "RU-YEV",
		Name:    "Еврейская автономная область",
	},
	{
		Iso3166: "RU-ZAB",
		Name:    "Забайкальский край",
	},
	{
		Iso3166: "RU-IVA",
		Name:    "Ивановская область",
	},
	{
		Iso3166: "RU-IRK",
		Name:    "Иркутская область",
	},
	{
		Iso3166: "RU-KB",
		Name:    "Кабардино-Балкарская Республика",
	},
	{
		Iso3166: "RU-KGD",
		Name:    "Калининградская область",
	},
	{
		Iso3166: "RU-KLU",
		Name:    "Калужская область",
	},
	{
		Iso3166: "RU-KAM",
		Name:    "Камчатский край",
	},
	{
		Iso3166: "RU-KC",
		Name:    "Карачаево-Черкесская Республика",
	},
	{
		Iso3166: "RU-KEM",
		Name:    "Кемеровская область",
	},
	{
		Iso3166: "RU-KIR",
		Name:    "Кировская область",
	},
	{
		Iso3166: "RU-KOS",
		Name:    "Костромская область",
	},
	{
		Iso3166: "RU-KDA",
		Name:    "Краснодарский край",
	},
	{
		Iso3166: "RU-KYA",
		Name:    "Красноярский край",
	},
	{
		Iso3166: "RU-KGN",
		Name:    "Курганская область",
	},
	{
		Iso3166: "RU-KRS",
		Name:    "Курская область",
	},
	{
		Iso3166: "RU-LEN",
		Name:    "Ленинградская область",
	},
	{
		Iso3166: "RU-LIP",
		Name:    "Липецкая область",
	},
	{
		Iso3166: "RU-MAG",
		Name:    "Магаданская область",
	},
	{
		Iso3166: "RU-MOS",
		Name:    "Московская область",
	},
	{
		Iso3166: "RU-MUR",
		Name:    "Мурманская область",
	},
	{
		Iso3166: "RU-NIZ",
		Name:    "Нижег ородская область",
	},
	{
		Iso3166: "RU-NGR",
		Name:    "Новгородская область",
	},
	{
		Iso3166: "RU-NVS",
		Name:    "Новосибирская область",
	},
	{
		Iso3166: "RU-OMS",
		Name:    "Омская область",
	},
	{
		Iso3166: "RU-ORE",
		Name:    "Оренбургская область",
	},
	{
		Iso3166: "RU-ORL",
		Name:    "Орловская область",
	},
	{
		Iso3166: "RU-PNZ",
		Name:    "Пензенская область",
	},
	{
		Iso3166: "RU-PER",
		Name:    "Пермский край",
	},
	{
		Iso3166: "RU-PRI",
		Name:    "Приморский край",
	},
	{
		Iso3166: "RU-PSK",
		Name:    "Псковская область",
	},
	{
		Iso3166: "RU-AD",
		Name:    "Республика Адыгея",
	},
	{
		Iso3166: "RU-AL",
		Name:    "Республика Алтай",
	},
	{
		Iso3166: "RU-BA",
		Name:    "Республика Башкортостан",
	},
	{
		Iso3166: "RU-BU",
		Name:    "Республика Бурятия",
	},
	{
		Iso3166: "RU-DA",
		Name:    "Республика Дагестан",
	},
	{
		Iso3166: "RU-IN",
		Name:    "Республика Ингушетия",
	},
	{
		Iso3166: "RU-KL",
		Name:    "Республика Калмыкия",
	},
	{
		Iso3166: "RU-KR",
		Name:    "Республика Карелия",
	},
	{
		Iso3166: "RU-KO",
		Name:    "Республика Коми",
	},
	{
		Iso3166: "RU-ME",
		Name:    "Республика Марий Эл",
	},
	{
		Iso3166: "RU-MO",
		Name:    "Республика Мордовия",
	},
	{
		Iso3166: "RU-SA",
		Name:    "Республика Саха (Якутия)",
	},
	{
		Iso3166: "RU-SE",
		Name:    "Республика Северная Осетия — Алания",
	},
	{
		Iso3166: "RU-TA",
		Name:    "Республика Татарстан",
	},
	{
		Iso3166: "RU-TY",
		Name:    "Республика Тыва",
	},
	{
		Iso3166: "RU-KK",
		Name:    "Республика Хакасия",
	},
	{
		Iso3166: "RU-ROS",
		Name:    "Ростовская область",
	},
	{
		Iso3166: "RU-RYA",
		Name:    "Рязанская область",
	},
	{
		Iso3166: "RU-SAM",
		Name:    "Самарская область",
	},
	{
		Iso3166: "RU-SAR",
		Name:    "Саратовская область",
	},
	{
		Iso3166: "RU-SAK",
		Name:    "Сахалинская область",
	},
	{
		Iso3166: "RU-SVE",
		Name:    "Свердловская область",
	},
	{
		Iso3166: "RU-SMO",
		Name:    "Смоленская область",
	},
	{
		Iso3166: "RU-STA",
		Name:    "Ставропольский край",
	},
	{
		Iso3166: "RU-TAM",
		Name:    "Тамбовская область",
	},
	{
		Iso3166: "RU-TVE",
		Name:    "Тверская область",
	},
	{
		Iso3166: "RU-TOM",
		Name:    "Томская область",
	},
	{
		Iso3166: "RU-TUL",
		Name:    "Тульская область",
	},
	{
		Iso3166: "RU-TYU",
		Name:    "Тюменская область",
	},
	{
		Iso3166: "RU-UD",
		Name:    "Удмуртская Республика",
	},
	{
		Iso3166: "RU-ULY",
		Name:    "Ульяновская область",
	},
	{
		Iso3166: "RU-KHA",
		Name:    "Хабаровский край",
	},
	{
		Iso3166: "RU-CHE",
		Name:    "Челябинская область",
	},
	{
		Iso3166: "RU-CE",
		Name:    "Чеченская Республика",
	},
	{
		Iso3166: "RU-CU",
		Name:    "Чувашская Республика",
	},
	{
		Iso3166: "RU-CHU",
		Name:    "Чукотский автономный округ",
	},
	{
		Iso3166: "RU-YAR",
		Name:    "Ярославская область",
	},
	{
		Iso3166: "RU-SPE",
		Name:    "Санкт-Петербург",
	},
	{
		Iso3166: "RU-MOW",
		Name:    "Москва",
	},
	{
		Iso3166: "RU-NEN",
		Name:    "Ненецкий автономный округ",
	},
	{
		Iso3166: "RU-KHM",
		Name:    "Ханты-Мансийский автономный округ",
	},
	{
		Iso3166: "RU-YAN",
		Name:    "Ямало-Ненецкий автономный округ",
	},
	{
		Iso3166: "RU-SEV",
		Name:    "Севастополь",
	},
	{
		Iso3166: "RU-KRY",
		Name:    "Республика Крым",
	},
}
